package cn.ideabuffer.process.core.aggregators;

/**
 * 单元化聚合器，是通用聚合器的一种特例，其输入类型和输出类型一致，可以通过单元化聚合器进行求和、汇总等。
 * <pre>
 *    ┌————————————————————┐               ┌————————————————————┐            ┌————————————————————┐
 *    |   MergeableNodeA   |               |   MergeableNodeB   |            |   MergeableNodeC   |
 *    └————————————————————┘               └————————————————————┘            └————————————————————┘
 *               |                                   |                                  |
 *               |                                   |                                  |
 *    ┌—————————————————————————┐       ┌—————————————————————————┐       ┌—————————————————————————┐
 *    |   NodeResultA(type:R)   |       |   NodeResultB(type:R)   |       |   NodeResultC(type:R)   |
 *    └—————————————————————————┘       └—————————————————————————┘       └—————————————————————————┘
 *               |                                   |                                  |
 *               |                                   |                                  |
 *               |___________________________________|__________________________________|
 *                                                   |
 *                                                   |
 *                                          ┌—————————————————┐
 *                                          |    Aggregator   |
 *                                          └—————————————————┘
 *                                                   |
 *                                                   |
 *                                        ┌——————————————————————┐
 *                                        |    result(type:R)    |
 *                                        └——————————————————————┘
 * </pre>
 *
 * @param <R> 输入类型/输出类型，输入与输出类型一致
 * @author sangjian.sj
 * @date 2020/03/28
 * @see GenericAggregator
 */
public interface UnitAggregator<R> extends GenericAggregator<R, R> {

}
